// Задача №18
// Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

// Console.Clear();
// int ReadData(string msg)
// {
//     Console.WriteLine(msg);
//     int res = int.Parse(Console.ReadLine() ?? "0");
//     return res;
// }
// //PrintQuterTest-печатаем тест четверти
// void PrintCoordTest(int quater)
// {
//     if (quater == 1) Console.WriteLine("x > 0 , y > 0");
//     if (quater == 2) Console.WriteLine("x > 0 , y < 0");
//     if (quater == 3) Console.WriteLine("x < 0 , y < 0");
//     if (quater == 4) Console.WriteLine("x < 0 , y > 0");
// }

// int quaterINT = ReadData("Введите Номер Четверти: ");

//Чтение данных консоли


// int ReadData(string message)
// {
//     Console.WriteLine(message);
//     int res = int.Parse(Console.ReadLine() ?? "0");
//     return res;
// }
// //метод ответа
// void PrintAnswer(int quoter)
// {
//     if (quoter==1) Console.WriteLine("(x от 1 до n, y 1 до n)");
//     if (quoter==2) Console.WriteLine("(x от 1 до n, y -1 до -n)");
//     if (quoter==3) Console.WriteLine("(x от -1 до -n, y -1 до -n)");
//     if (quoter==4) Console.WriteLine("(x от -1 до -n, y 1 до n)");
// }

// //вызовы методов
// int quoter = ReadData("Введите четверть: ");
// PrintAnswer(quoter);


